//MARK: Tab labels
"Tab buttons" = "Buttons";
"Tab cursor" = "Mouse";
"Tab scroll" = "Scroll";
"Tab keys" = "Keyboard";
"Tab apps" = "Exception";
"Tab settings" = "Settings";

//MARK: Action menu items
"Button action Double Click" = "Double Click";
"Button action Triple Click" = "Triple Click";
"Button action Look Up" = "Look Up";
"Button action Smart Zoom" = "Smart Zoom";
"Button action Cmd Click" = "⌘ Click";
"Button action Shift Cmd Click" = "⇧⌘ Click";
"Button action Shift Click" = "⇧ Click";
"Button action Ctrl Cmd Click" = "⌃⌘ Click";
"Button action Option Click" = "⌥ Click";
"Button action Left Click" = "Left Click";
"Button action Middle Click" = "Middle Click";
"Button action Right Click" = "Right Click";
"Button action Mod Clicks" = "Mod Clicks";
"Button action Zoom Window" = "Zoom Window";
"Button action Fullscreen Window" = "Fullscreen Window";
"Button action Backlight" = "Backlight";
"Button action Backlight Down" = "Backlight Down";
"Button action Backlight Up" = "Backlight Up";
"Button action Media Next" = "Next Track";
"Button action Media Play/Pause" = "Play/Pause";
"Button action Media Previous" = "Previous Track";
"Button action Mute Mic" = "Mic Mute Toggle";
"Button action Swipe Back" = "Swipe Back";
"Button action Swipe Forward" = "Swipe Forward";
"Button action Pan" = "Pan Scroll";
"Button action 2 Finger Scroll" = "2 Fgr Scroll";
"Button action 3 Finger Swipe L" = "3 Fgr Swipe ←";
"Button action 3 Finger Swipe R" = "3 Fgr Swipe →";
"Button action 3 Finger Swipe U" = "3 Fgr Swipe ↑";
"Button action 3 Finger Swipe D" = "3 Fgr Swipe ↓";
"Button action 3 Finger Pinch in" = "3 Fgr Pinch In";
"Button action 3 Finger Pinch out" = "3 Fgr Pinch Out";
"Button action Scroll Left" = "Scroll Left";
"Button action Scroll Right" = "Scroll Right";
"Button action Zoom In" = "Zoom In";
"Button action Zoom Out" = "Zoom Out";
"Button action Volume" = "Volume";
"Button action Volume Down" = "Volume Down";
"Button action Volume Mute" = "Volume Mute";
"Button action Volume Up" = "Volume Up";
"Button action App Switch" = "App Switch";
"Button action Sleep" = "Sleep";
"Button action Logout" = "Logout";
"Button action Screen Off" = "Screen Off";
"Button action Lock Screen" = "Lock Screen";
"Button action App Launch" = "App Launch";
"Button action IM Switch" = "IM Switch";
"Button action Extra Keys" = "Extra Keys";
"Button action Shift Scroll" = "Horizontal scroll";
"Button action Cmd Scroll" = "Fast Scroll";
"Button action Ctrl Scroll" = "Zoom";
"Button action Do Nothing" = "Do Nothing";

//MARK: Question Mark Helps
//Buttons tab
"Help left click through" = "When you click on a button in an inactive window, you only need to click once if this option is enabled.";
"Help right click through" = "Activate the corresponding window first when you right-click an inactive window.";
"Help trackpad left click through" = "Trackpad left click through";
"Help trackpad right click through" = "Trackpad right click through";
"Help binding click through" = "This column of toggles is the click-through option for each item. When enabled, the window under the cursor will be activated first before the bound action fires.\n\nFor example, if it's enabled for shortcut ⌘+w, it will close the window under the cursor, instead of the currently active one.\n\nSome actions are not meant to act this way because they are not window related, so we hide this option for those.";
"Help pan" = "Scroll freely in any direction by dragging with a button, similar to trackpad scrolling. You can also zoom or change the speed with modifier keys set on the Scroll tab.\n\nClick the box to highlight it, then click the button you want to assign for panning.\n\nLeft-click again while the box is highlighted to turn off the pan feature.\n\nThe pan function disables drag gestures assigned to that button.";
"Help pan momentum" = "Trackpad-style inertia for the right button pan which we think you would love.";
"Help multishot" = "This column of toggles is the multi-shot option for hotkey bindings of the directional and long-press gestures.\n\nEnable this to trigger the corresponding hotkey repeatedly with gesture movement.\n\nActions in the dropdown list have their intrinsic multi-shot properties and have no option here.";

//Mouse tab
"Help cursor switch" = "This is the same control as \"System Settings -> Mouse -> Tracking speed\", but with acceleration and speed separated as they should be.\n\nFor macOS Sonoma, you should turn \"System Settings -> Mouse -> Advanced -> Pointer acceleration\" ON to have both sliders functional properly.\n\nThese two sliders and the Tracking speed in System Settings may override each other. If you turn this cursor control on, please avoid changing it in the System Settings panel or other apps.\n\nIf you toggle this off, the app will return these to the system default.\n\nRecommended values for Windows users: \nAcceleration: 0";
"Help cursor hold" = "Keep the mouse cursor still while in directional gestures or panning.";
"Help unifying pairing" = "1. Select a channel on your mouse, then turn off the mouse.\n\n2. Click the pair button on the left to put your USB receiver into pairing mode.\n\n3. Turn on your mouse to have it search and paired with the dongle.\n\nClick the x button next to each slot to have your dongle erase the pairing info and free that slot for pairing a new device.";
"Help bolt pairing" = "1. Long press the channel button on your device until the LED blinks fast.\n\n2. Click the Pair button on the left.\n\n3.a For keyboards, input the number code displayed, then press Enter.\n\n3.b For mice, input the left/right sequence with the left/right click, then press the left and right buttons simultaneously as Enter.";
"Help Onboard profile" = "Disable onboard profiles to release all those profile-switching & preset buttons for binding. Or enable this if you want to use your onboard settings.";
"Help quirk buttons" = "These vendor-defined buttons have been hard-coded to functions like alt-tab or switching ratchet mode.\n\nCheck these boxes to make them act like a standard button and can be recognized on the Buttons tab for bindings.";
"Help hires wheel" = "In this mode, the scroll wheel outputs much denser ticks(usually 8x). Your scrolling will feel much smoother accordingly.\n\nWorks the best in the free-spin mode.\n\nThe Scroll panel settings need to be adjusted accordingly. We suggest turning the \"brake point\", \"speed\", and \"more smooth\" sliders all to the minimum in this mode, and only adjusting the \"duration\" and \"acceleration\" to feel like the trackpad the most.";
"Help ratchet" = "You can only use this toggle to switch between the ratchet and free spin modes of the scroll wheel if you've enabled the physical button(usually button 6) for binding above.";
"Help thumbwheel for shortcuts" = "Using this mode, you can bind click, long press & left/right directional gestures to the thumbwheel in the Buttons panel.\n\nIf you want the thumbwheel to perform different functions in different apps, you need to use this mode.";
"Help thumbwheel for hscroll" = "";
"Help thumbwheel for vscroll" = "This's offered as an option only because we can, not because we think it makes any sense.";
"Help thumbwheel for zoom" = "";
"Help thumbwheel dir inv" = "Direction selection for 4 options above separately.";

//Keyboard Tab
"Help keys sub" = "System-level substitution from one physical key to another per keyboard. It has a higher priority than the general & Logi keys map above.\n\nClick the arrow in the middle to switch between uni- or bi-directional mapping.\n\nOnly one map is allowed for a key.";
"Help logi keyb" = "App-level maps of Logi reprogrammable keys. The green ones are non-standard keys that are not on Fn keys.\n\nYou can bind these to key combos or actions from the dropdown list just like the bindings for mouse buttons.\n\nHas a higher priority than the general keys map above.";
"Help logi keyb brightness" = "This line doesn't offer any control, it only indicates the current keyboard backlight brightness level and the control source.\n\nThe \"Automatic\" means ambient light dependent.\n\nWhen in automatic mode, the brightness bar may not reflect the actual value for some keyboards.";
"Help general key bind" = "App-level general maps from a keystroke or key combo to another keystroke/key combo/action.\n\nClick the plus button to add a mapping item, and click each box to set the keyboard input focus.";

//Scroll tab
"Help scroll smooth" = "This toggle controls all vertical, horizontal, and shift-scroll smoothness, and the ctrl-scroll zoom relies on this to function.";
"Help scroll more smooth" = "A simple post filter to smooth scrolls out even further, applied after the above 4 parameters, with virtually no overhead, gives you another dimension of control between swiftness and smoothness.\n\nIt has no effect when set to 0, if you don't like it. It feels more sluggish but smoother when set higher.";
"Help scroll acc" = "Content scroll further when you spin the same angle of the wheel in a shorter period. This parameter decides the intensity of this effect.\n\nIt's now been implemented by software, and won't be affected by the \"Mouse->Scrolling speed\" in System Settings.";
"Help scroll to raise" = "Scroll over a window to bring it up.\n\nWith the left-click-through enabled, we were constantly stressed by the fear of accidentally clicking on something we shouldn't while trying to activate a window, like a calculator window filled with buttons.\n\nWe found this feature to be by far the least stressful way to activate a window.\n\nIt'd be better to uncheck it when you fiddle with other scrolling parameters to keep the window floating.";
"Help scroll brake" = "The setting is for smooth scroll only. It determines from which frame a scroll start to decelerate, ranging from 1 to the duration.";
"Help scroll distance" = "With smooth scroll on, it's pixels per frame, with smooth scroll off, it's lines per tick.\n\nIt has 4 different saved values, according to smooth & acceleration settings, differentiated by colors.";
"Help scroll duration" = "Scroll duration for one wheel tick in smooth scroll, in the unit of frames.\n\nIt's refresh rate adaptive, say you set this value at 20, and you get 20/60 = 1/3sec scroll duration no matter if your system refresh rate is 60Hz or 120Hz.";
"Help scroll hori invert" = "Horizontal scroll direction inverse for physical mouse wheel only. ";
"Help scroll hori speed" = "Horizontal scroll speed gain control. 5 is the system default speed, which means the adjustment range is 0.2 ~ 10 times the default.\n\nThe Physical H scroll refers mainly to wheel tilt and the thumbwheel scroll when you set it to \"Use for H scroll\" on the Mouse tab.";
"Help scroll vert invert" = "Vertical scroll direction inverse for mouse wheel only. If you have 3rd party mouse driver installed, this setting may get confusing due to cascaded control.";
"Help shift scroll" = "Hold the mod key while scrolling to get horizontal scrolling.";
"Help ctrl scroll zoom" = "Hold the mod key while scrolling or panning up/down to perform zoom/pinch.";
"Help cmd scroll" = "Hold the mod key while scrolling/zooming/panning to get an altered speed.\n\nWorks for all H/V physical scrolls, shift-scroll, ctrl-scroll, thumbwheel scroll/zoom, gesture zoom, pan & ctrl-pan.";
"Help cmd scroll speed" = "";

//Setting tab
"Help hide icon" = "Hide the menu bar icon.\n\nLaunch the app again while it's already running to make the menu bar icon appear.";
"Help color scheme" = "Uncheck both toggles to get the color scheme to follow the system.";
"Help tighten icons" = "An irrelevant feature that may come in handy. It makes your menu bar icons more crowded.\n\nTake effect next time you log in.";
"Help charge limit" = "Another irrelevant feature that may come in handy.\n\nUse Apple's new built-in switch to limit the battery charge to 80%. Available since Apple silicon and macOS 13. It has only one option of 80% without any other choices.\n\nThis is a firmware switch, which means once set, you don't need to have the app running to keep it. It can also survive sleep/wake cycles without any attention.\n\nHowever, it can't survive power cycles, which means you still need to launch the app to enable it after a power-up.\n\nChanges need about a minute to take effect, be patient.\n\nIf you enable this with your battery over 80% charged, it will be discharged to 80% by firmware automatically, you don't need to pull the plug.\n\n\"Allow in the Background\" permission is needed. But in fact, nothing runs in the background. It's merely a way of running \"sudo\" in the app. The description of the background items in the Settings app is a bit confusing IMHO. This permission doesn't need to be allowed as long as you keep this feature off.";
"Help charge limit 147+" = "Since macOS 14.7, Apple has removed the built-in firmware 80% charge limiter and is unlikely to reinstate it.\n\nSo we fall back to the conventional, more primitive software-based limiter here, merely because we really don't want to keep another app running for such a simple thing.";
"Help activate license" = "If you purchased before or on the website and just enter the activation code here, please restart the app after finishing and wait for 10s for the app to turn green.";
"Help deactivate" = "Yes, clicking the \"Deactivate License\" button in the pop-up window can remove this activation from your license, freeing up a slot for future use.";
"Help v scroll sliders" = "Scroll over a slider to adjust it. This works for sliders that can be recognized by VoiceOver.";
"Help h scroll sliders" = "Scroll over a slider to adjust it. This works for sliders that can be recognized by VoiceOver.\n\nThis can be triggered not only by physical horizontal scrolling, but also by shift-scrolling and h-scrolling through gestures.";
"Help interfering apps" = "Apps that have the capability of manipulating mouse and keyboard actions as well in real-time.";

//MARK: Button Binding Hint
"btn hint double click"				= "Simulated double click, naturally comes with a click-through effect.";
"btn hint triple click"				= "Simulated triple click, naturally comes with a click-through effect.";
"btn hint look up"					= "Also known as force click, or cmd-ctrl-D.";
"btn hint smart zoom"				= "The equivalent of double-tap with two fingers on the trackpad.";
"btn hint cmd click"				= "Simulated left-click with CMD pressed.\n\nIf you want to drag with this click as well, you have to remove all other mappings of this button.";
"btn hint shift cmd click"			= "Simulated left-click with Shift and CMD pressed.\n\nIf you want to drag with this click as well, you have to remove all other mappings of this button.";
"btn hint shift click"				= "Simulated left-click with Shift pressed.\n\nIf you want to drag with this click as well, you have to remove all other mappings of this button.";
"btn hint ctrl cmd click"			= "Simulated left-click with Ctrl and CMD pressed. This is used to drag a window from any position with [NSWindowShouldDragOnGesture](https://www.google.com/search?q=NSWindowShouldDragOnGesture) enabled in Terminal.\n\nIf you want to drag with this click as well, you have to remove all other mappings of this button.";
"btn hint option click"				= "Simulated left-click with Option pressed.\n\nIf you want to drag with this click as well, you have to remove all other mappings of this button.";
"btn hint left click"				= "Simulated left click for your repetitive strain injury on demand.\n\nIf you want to drag with this click as well, you have to remove all other mappings of this button.";
"btn hint middle click"				= "Simulated middle-click.\n\nIf you want to drag with this click as well, you have to remove all other mappings of this button.";
"btn hint right click"				= "Simulated right-click.\n\nIf you want to drag with this click as well, you have to remove all other mappings of this button.";
"btn hint mod clicks"				= "If you also want to drag with the assigned click, this button must have no other bindings.";
"btn hint swipe forward"			= "A simulation of two-finger swiping left on the trackpad, but with no animation.";
"btn hint swipe back"				= "A simulation of two-finger swiping right on the trackpad, but with no animation.";
"btn hint 3 finger swipe L"			= "Our fast version of switching between desktop spaces.\n\nIf you don't like it and prefer the original system version, assign \"ctrl + →\" instead.";
"btn hint 3 finger swipe R"			= "Our fast version of switching between desktop spaces.\n\nIf you don't like it and prefer the original system version, assign \"ctrl + ←\" instead.";
"btn hint 3 finger swipe U"			= "Our fast version of mission control.\n\nIf you don't like it and prefer the original system version, assign \"ctrl + ↑\" instead.";
"btn hint 3 finger swipe D"			= "Our fast version of App exposé.\n\nIf you don't like it and prefer the original system version, assign \"ctrl + ↓\" instead.";
"btn hint 3 finger pinch in"		= "Our fast version of Launchpad.\n\nIf you don't like it and prefer the original system version, you need to assign a hotkey for it in the System Settings, then bind that hotkey here.";
"btn hint 3 finger pinch out"		= "Our fast version of show desktop.\n\nIf you don't like it and prefer the original system version, assign \"F11\" instead.";

"btn hint scroll left"				= "A single shot of scrolling left. Implemented via shift-scroll. To turn this into a multi-shot, bind it to a long-press instead of a button click.";
"btn hint scroll right"				= "A single shot of scrolling right. Implemented via shift-scroll. To turn this into a multi-shot, bind it to a long-press instead of a button click.";
"btn hint zoom in"					= "A single shot of zooming in. Implemented via ctrl-scroll. To turn this into a multi-shot, bind it to a long-press instead of a button click.";
"btn hint zoom out"					= "A single shot of zooming out. Implemented via ctrl-scroll. To turn this into a multi-shot, bind it to a long-press instead of a button click.";
"btn hint zoom window"				= "An equivalent of option-click the green button or double-click the title bar of a window.\n\nIn case you're not familiar with:\nQuit app:				⌘Q\nForce quit app:		⌥⌘ESC\nClose tab or window:	⌘W\nClose window:		⇧⌘W\nMinimize window:		⌘M";
"btn hint fullscreen window"		= "An equivalent of click the green button of a window.\n\nIn case you're not familiar with:\nQuit app:				⌘Q\nForce quit app:		⌥⌘ESC\nClose tab or window:	⌘W\nClose window:		⇧⌘W\nMinimize window:		⌘M";
"btn hint media p/p"				= "";
"btn hint media prev"				= "";
"btn hint media next"				= "";
"btn hint mute mic"					= "This will display a mute icon on the menu bar when muted. You can also click the icon to unmute.";
"btn hint vol mute"					= "";
"btn hint vol up"					= "";
"btn hint vol down"					= "";
"btn hint backlight up"				= "";
"btn hint backlight down"			= "";
"btn hint sleep"					= "";
"btn hint logout"					= "";
"btn hint screen off"				= "";
"btn hint lock screen"				= "";
"btn hint app launch"				= "BetterMouse doesn't support scripts as a target directly. However, you can export your script as an app with the Script Editor app, move it to the Applications folder, then select it here.";
"btn hint IM switch"				= "Input method/keyboard source switch";
"btn hint do nothing"				= "If no action is assigned to a button click, the original button click event is sent. If you assign this item to a button, nothing is sent, to avoid false triggers.\n\nUsually used on the thumbwheel.";

//MARK: Button-scroll Binding Hint
"btnscl hint hori scroll"			= "A mimic of shift-scroll.";
"btnscl hint fast scroll"			= "A mimic of CMD-scroll.";
"btnscl hint zoom"					= "A mimic of ctrl-scroll.";
"btnscl hint app switch"			= "";
"btnscl hint vol"					= "";
"btnscl hint backlight"				= "";

//MARK: Gesture Binding Hint
"ges hint smart zoom"				= "The equivalent of double-tap with two fingers on the trackpad.";
"ges hint swipe forward"			= "One shot of two-finger swiping left on the trackpad, with no animation.";
"ges hint swipe back"				= "One shot of two-finger swiping right on the trackpad, with no animation.";
"ges hint 2 finger scroll"			= "A simulation of 2 fingers swiping on the trackpad with a mouse drag gesture. It can be used as swipe left/right gestures, like the \"Swipe Forward/Back\" above, but with animations. Or it can be used simply as scrolling.\n\nThe difference between this and the \"Pan\" this app offers is, that the Pan is a pure scroll and doesn't trigger any gesture, thus feels more responsive and effortless. Also, the Pan has been set with a lower inertial friction.";
"ges hint pan"						= "You don't have enough buttons. You can't afford a whole button dedicated to panning, you have a much bigger plan for that button. However, you've found that the 2 finger scroll is too sticky to be used for pure scrolling(it can't scroll diagonally and comes with OS gestures inherently), which is where this pan scroll comes in.\n\nIt's the same as the button pan below, but it only needs one directional gesture to trigger it. Once it gets triggered, you can pan in any direction as usual.";
"ges hint 3 finger swipe L"			= "Our fast version of switching between desktop spaces.\n\nIf you don't like it and prefer the original system version, assign \"ctrl + →\" instead.";
"ges hint 3 finger swipe R"			= "Our fast version of switching between desktop spaces.\n\nIf you don't like it and prefer the original system version, assign \"ctrl + ←\" instead.";
"ges hint 3 finger swipe U"			= "Our fast version of mission control.\n\nIf you don't like it and prefer the original system version, assign \"ctrl + ↑\" instead.";
"ges hint 3 finger swipe D"			= "Our fast version of App exposé.\n\nIf you don't like it and prefer the original system version, assign \"ctrl + ↓\" instead.";
"ges hint 3 finger pinch in"		= "Our fast version of Launchpad.\n\nIf you don't like it and prefer the original system version, you need to assign a hotkey for it in the System Settings, then bind that hotkey here.";
"ges hint 3 finger pinch out"		= "Our fast version of show desktop.\n\nIf you don't like it and prefer the original system version, assign \"F11\" instead.";
"ges hint scroll left"				= "When you want a convenient way to scroll left/right but don't like all four directions of a button being occupied by the Pan, and don't want the triggering of \"go forward/back\" by the 2-finger scroll either, you should use this one.";
"ges hint scroll right"				= "When you want a convenient way to scroll left/right but don't like all four directions of a button being occupied by the Pan, and don't want the triggering of \"go forward/back\" by the 2-finger scroll either, you should use this one.";
"ges hint zoom in"					= "Continuous zoom by directional gestures, with a click-through mandatorily since it has no effect on inactive windows.";
"ges hint zoom out"					= "Continuous zoom by directional gestures, with a click-through mandatorily since it has no effect on inactive windows.";
"ges hint zoom window"				= "An equivalent of option-click the green button or double-click the title bar of a window.\n\nIn case you're not familiar with:\nQuit app:				⌘Q\nForce quit app:		⌥⌘ESC\nClose tab or window:	⌘W\nClose window:		⇧⌘W\nMinimize window:		⌘M";
"ges hint fullscreen window"		= "An equivalent of click the green button of a window.\n\nIn case you're not familiar with:\nQuit app:				⌘Q\nForce quit app:		⌥⌘ESC\nClose tab or window:	⌘W\nClose window:		⇧⌘W\nMinimize window:		⌘M";
"ges hint media p/p"				= "";
"ges hint prev"						= "";
"ges hint next"						= "";
"ges hint mute mic"					= "This will display a mute icon on the menu bar when muted. You can also click the icon to unmute.";
"ges hint vol mute"					= "";
"ges hint vol up"					= "";
"ges hint vol down"					= "";
"ges hint backlight up"				= "";
"ges hint backlight down"			= "";
"ges hint app switch"				= "A simulation of the alt-tab with a mouse drag gesture.";
"ges hint sleep"					= "";
"ges hint logout"					= "";
"ges hint screen off"				= "";
"ges hint lock screen"				= "";
"ges hint app launch"				= "BetterMouse doesn't support scripts as a target directly. However, you can export your script as an app with the Script Editor app, move it to the Applications folder, then select it here.";
"ges hint IM switch"				= "";

//MARK: General Key Binding Hint
"gkey hint sleep"					= "";
"gkey hint logout"					= "";
"gkey hint screen off"				= "";
"gkey hint lock screen"				= "";
"gkey hint do nothing"				= "";
"gkey hint swipe forward"			= "A simulation of two-finger swiping left on the trackpad, but with no animation.";
"gkey hint swipe back"				= "A simulation of two-finger swiping right on the trackpad, but with no animation.";
"gkey hint 3 finger swipe L"		= "Our fast version of switching between desktop spaces.\n\nIf you don't like it and prefer the original system version, assign \"ctrl + →\" instead.";
"gkey hint 3 finger swipe R"		= "Our fast version of switching between desktop spaces.\n\nIf you don't like it and prefer the original system version, assign \"ctrl + ←\" instead.";
"gkey hint 3 finger swipe U"		= "Our fast version of mission control.\n\nIf you don't like it and prefer the original system version, assign \"ctrl + ↑\" instead.";
"gkey hint 3 finger swipe D"		= "Our fast version of App exposé.\n\nIf you don't like it and prefer the original system version, assign \"ctrl + ↓\" instead.";
"gkey hint 3 finger pinch in"		= "Our fast version of Launchpad.\n\nIf you don't like it and prefer the original system version, you need to assign a hotkey for it in the System Settings, then bind that hotkey here.";
"gkey hint 3 finger pinch out"		= "Our fast version of show desktop.\n\nIf you don't like it and prefer the original system version, assign \"F11\" instead.";
"gkey hint zoom window"				= "An equivalent of option-click the green button or double-click the title bar of a window.\n\nIn case you're not familiar with:\nQuit app:				⌘Q\nForce quit app:		⌥⌘ESC\nClose tab or window:	⌘W\nClose window:		⇧⌘W\nMinimize window:		⌘M";
"gkey hint fullscreen window"		= "An equivalent of click the green button of a window.\n\nIn case you're not familiar with:\nQuit app:				⌘Q\nForce quit app:		⌥⌘ESC\nClose tab or window:	⌘W\nClose window:		⇧⌘W\nMinimize window:		⌘M";
"gkey hint media p/p"				= "";
"gkey hint media prev"				= "";
"gkey hint media next"				= "";
"gkey hint mute mic"				= "This will display a mute icon on the menu bar when muted. You can also click the icon to unmute.";
"gkey hint vol mute"				= "";
"gkey hint vol up"					= "";
"gkey hint vol down"				= "";
"gkey hint backlight up"			= "";
"gkey hint backlight down"			= "";
"gkey hint app launch"				= "BetterMouse doesn't support scripts as a target directly. However, you can export your script as an app with the Script Editor app, move it to the Applications folder, then select it here.";
"gkey hint IM switch"				= "Input method/keyboard source switch";
"gkey hint extra keys"				= "";
"gkey hint clicks"					= "Though you can use this on a keystroke, it's not meant to. Some mice can't map some of their extra buttons to standard mouse buttons, but can map them to keystrokes. That's the purpose of this item.";

//MARK: Button Tab
"Long press delay" = "Long Press Trigger Delay(ms)";
"Long press interval" = "Long Press Repeat Interval(ms)";
"Button tab CT & Pan" = "Click Through & Pan";
"Button tab left click through" = "Left click-through";
"Button tab right click through" = "Right click-through";
"Button tab trackpad left click through" = "Trackpad LCT";
"Button tab trackpad right click through" = "Trackpad RCT";
"Button tab No button pan" = "No button pan";
"Button tab Right button pan" = "Right button pan";
"Button tab Thumbwheel pan" = "Thumbwheel pan";
"Button tab Button" = "Button ";
"Button tab pan" = " pan";
"Button tab Right" = "Right";
"Button tab Wheel" = "Wheel tilt";
"Button tab Thumbwheel" = "Thumbwheel";
"Button tab Tap" = "Tap";
"Button tab pan momentum" = "Pan momentum";
"Button tab pan invert" = "Pan dir invert";
"Button tab pan CT" = "Pan click-through";
"Button tab thumbwheel" = "Thumbwheel bindings";

"Button tab description 1" = "1.	Perform a mouse action to add or highlight an entry.\n\n2.	Select a target action from the dropdown list or input a key combo directly from your keyboard.\n\n";
"Button tab description 2" = "Mouse actions include:\n\n1.	Click with buttons other than the left and right.\n2.	Drag with buttons other than the left button.\n3.	Long press with buttons other than the left button.\n4.	Hold any button down and scroll the wheel up or down.\n\n";
"Button tab description 3" = "All these actions can be combined with any combination with five modifier keys(Fn⇧⌃⌥⌘), another mouse button, or both.\n\n";
"Button tab description 4" = "When combined with another button, the left and right buttons can now also have arbitrary actions.\n\n";
"Button tab description 5" = "The long press can be used as a multi-shot of an action.\n\nBind to shortcuts in \"System Preferences -> Keyboard -> Shortcuts\" to get most system actions.\n\nFor apps with built-in mouse drivers/interpreters(like games), add them in the exception panel and configure them separately.\n\nQuit this panel or tab to have your assignments take effect.";

"Button tab new item" = "Press a mouse button to add a new item";
"Button tab Hide help" = "Hide help";
"Button tab Show help" = "Show help";
"Button tab wheel" = "Wheel ";
"Hint binding click through" = "Click through";
"Hint binding multishot" = "Multi-shot";

//MARK: Mouse Tab
"Cursor tab acceleration" = "Acceleration:";
"Cursor tab enable Cursor Control" = "Cursor Control";
"Cursor tab speed" = "Speed:";
"Cursor tab Cursor hold in gesture" = "Cursor Hold In Gesture";
"Cursor tab Left drag deadzone" = "Left Drag Dead Zone";
"Toggle enable DPI Control" = "Enable DPI Control";
"Slider DPI" = "DPI:";
"For binding" = "For binding:";
"SW Control" = "Main wheel:";
"Ratchet mode" = "Ratchet mode";
"Hi-res wheel" = "Hi-res wheel";
"Toggle enable Onboard Profile" = "Enable Onboard Profiles";
"Slider disengage" = "Disengage:";
"Slider torque" = "Torque:";
"Slider Action Ring Button Pressure" = "AR Pressure:";
"Toggle hori wheel" = "Thumbwheel:";
"Hori wheel option 1" = "Use as a button";
"Hori wheel option 2" = "Use for H scroll";
"Hori wheel option 3" = "Use for V scroll";
"Hori wheel option 4" = "Use for Zoom";
"Toggle hori wheel direction" = "Direction:";
"Toggle hori wheel direction label" = "Invert";
"Toggle hori wheel gain" = "Speed gain:";
"Toggle wheel tap" = "Wheel tap:";
"Toggle wheel tap label" = "Enable";
"Title unifying Receiver" = "Unifying Receiver";
"Title bolt Receiver" = "Bolt Receiver";
"Title lightspeed Receiver" = "Lightspeed Receiver";
"Button pairing" = "Pairing ";
"Button pair" = "Pair";
"Slider label always Engage" = "Always Engage";
"Bar Report rate" = "Report rate";
"Slider Report rate" = "Report rate:";
"Bar Onboard profile" = "Onboard profile";
"Bar Extra buttons" = "Extra buttons";
"Bar Main wheel" = "Main wheel";
"Bar Thumb wheel" = "Thumb wheel";
"Bar Action ring button" = "Action ring button";
"Slider Pressure" = "Pressure:";
"Slider Haptic force" = "Haptic force:";
"Toggle Haptic enable" = "Haptic enable:";
"Toggle for actions" = "For single shot actions";
"Toggle for multishot actions" = "for multishot actions";
"Slider Pattern" = "Pattern:";

//MARK: Keyboard Tab
"Keys tab General key mapping" = "General key mapping";
"Keys tab Non-standard key mapping" = "Logi non-standard key mapping";
"Keys tab enable modifier key substitution control" = "Physical key substitution";
"Keys tab Backlight" = "Backlight";
"Keys tab Fn Inversion" = "Fn Inversion";

//MARK: Scroll Tab
"Scroll tab Physical V Scroll" = "Physical V Scroll";
"Scroll tab Physical H Scroll" = "Physical H Scroll";
"Scroll tab Modified V Scroll" = "Modified V Scroll";
"Scroll tab acceleration" = "Acceleration";
"Scroll tab more smooth" = "More smooth";
"Scroll tab brake Point" = "Brake point";
"Scroll tab duration" = "Duration";
"Scroll tab enable Smooth Scroll" = "Smooth scroll";
"Scroll tab hori invert" = "H scroll dir invert";
"Scroll tab hori speed" = "Horizontal scroll speed";
"Scroll tab scroll Raise" = "Scroll to raise";
"Scroll tab v scroll sliders" = "V Scroll Sliders";
"Scroll tab h scroll sliders" = "H Scroll Sliders";
"Scroll tab speed" = "Speed";
"Scroll tab vert invert" = "Vertical dir invert";
"Scroll tab shift scroll" = "to H scroll";
"Scroll tab shift scroll invert" = "H scroll dir invert";
"Scroll tab ctrl scroll" = "to zoom";
"Scroll tab ctrl scroll invert" = "Zoom dir invert";
"Scroll tab cmd scroll" = "to fast scroll";
"Scroll tab cmd scroll speed" = "Mod scroll/pan speed gain";
"Scroll tab thumb wheel zoom" = "Thumbwheel Zoom";
"Seperator main scroll control" = "Main Scroll Control";
"Seperator physical scroll invert" = "Physical Scroll Direction Invert";
"Seperator shift-scroll to horizontal" = "Shift-Scroll to Horizontal";
"Seperator zoom/pinch" = "Zoom/Pinch";

//MARK: Settings Tab
"Setting tab buy" = "Buy";
"Setting tab web buy" = "Buy from website";
"Setting tab reset" = "Wipe out all settings";
"Setting tab email Feedback" = "Email Feedback";
"Setting tab homepage" = "Homepage";
"Setting tab Check for update" = "Check for update";
"Setting tab quit" = "Quit";
"Setting tab registered to" = "Registered to:";
"Setting tab run at login" = "Run at login";
"Setting tab hide icon" = "Hide menu bar icon";
"Setting tab dark mode" = "Dark Mode";
"Setting tab light mode" = "Light Mode";
"Setting tab auto update" = "Automatically check for updates";
"Setting tab tighten icon" = "Tighten menu bar icon spaces";
"Setting tab charge limit" = "Limit battery level to 80%";
"Setting tab mic mute notif" = "Mic Mute Popup";
"Setting tab capslock notif" = "Capslock Popup";
"Setting tab activate" = "Activate/Deactivate License";
"Setting tab trial expired, thanks for using it!" = "Trial expired, thanks for using it!";
"Setting tab trial period left" = "Trial days left: ";
"Button save settings to file" = "Save settings to file";
"Button load settings from file" = "Load settings from file";
"Message save fail" = "Save to file failed.";
"Message load fail" = "Load failed, the file contains a different version of settings, or not a valid setting file.";
"Message load success" = "Setting Load Successfully";
"Message relaunch" = "App will relaunch.";
"Setting tab wipe out all alert title" = "BetterMouse\nWipe out all settings";
"Setting tab wipe out all alert message" = "Every time you load settings from a file, the app will wipe all current settings out first. So unless you really want to start over from scratch again, you don't need to do this.\n\nEven though, you'd feel better saving your settings beforehand.\n\nDo you want to wipe out all your settings?";

//MARK: Exception Tab
"Button add running apps" = "Add running apps";
"Button add manually" = "Add manually";
"Exception tab scroll using global" = "Scroll settings disabled\nUsing global settings";
"Exception tab disabled" = "Exception disabled\nUsing global settings";
"Message invalid" = "It's not a valid app.";
"Exception hint remove all" = "Remove all items";
"Exception hint load global" = "Load the global settings";
"Exception hint button lock" = "Button binding editing lock\n\nWhen unlocked, any changes to global button bindings of identical(white) items will be synchronized here, including adding/removing items, click-through, and pan settings.\n\nWhen locked, changes made outside will not affect settings here.";
"Exception hint scroll switch" = "Scroll settings exception/global switch\n\nThe global scroll settings will be applied instead by turning this switch off.\n\nThis switch is for those apps that are only meant to have different button/keystroke bindings.";
"Exception hint key lock" = "Key map editing lock\n\nSimilar to the button binding lock.";

//MARK: Dialogs
"trusted alert message" = "Every app with system-wide impacts (not limited to the app itself) needs accessibility permission, and can't land on the App Store. So do ours.\n\nReopen the app once you enabled it in System Preferences -> Security & Privacy -> Privacy -> Accessibility.";
"Button ok" = "OK";
"trusted alert title" = "Enable BetterMouse";
"Button relaunch" = "Relaunch";
"Button cancel" = "Cancel";
"Button quit" = "Quit";
"Button yes" = "YES";
"Button restart" = "Restart";

